Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70Q21.PIC
      <edc:AdjustPoint edc:_addr="0x400280EC" edc:offset="0x3F14"/>
      <edc:SFRDef edc:_addr="0x4002C000" edc:access="----------wwwwwwwwwwwwwwwwwwww--" edc:cname="US_CR" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RSTRX" edc:desc="Reset Receiver" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTTX" edc:desc="Reset Transmitter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXEN" edc:desc="Receiver Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXDIS" edc:desc="Receiver Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEN" edc:desc="Transmitter Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXDIS" edc:desc="Transmitter Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTSTA" edc:desc="Reset Status Bits" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTBRK" edc:desc="Start Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STPBRK" edc:desc="Stop Break" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="STTTO" edc:desc="Clear TIMEOUT Flag and Start Time-out After Next Character Received" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="SENDA" edc:desc="Send Address" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTIT" edc:desc="Reset Iterations" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RSTNACK" edc:desc="Reset Non Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RETTO" edc:desc="Start Time-out Immediately" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTREN" edc:desc="Data Terminal Ready Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DTRDIS" edc:desc="Data Terminal Ready Disable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTSEN" edc:desc="Request to Send Pin Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RTSDIS" edc:desc="Request to Send Pin Control" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINABT" edc:desc="Abort LIN Transmission" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="LINWKUP" edc:desc="Send LIN Wakeup Signal" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C004" edc:access="nnnn-nnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="US_MR" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="USART_MODE" edc:desc="USART Mode of Operation" edc:nzwidth="0x4">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0xF) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="RS485" edc:desc="RS485" edc:when="(field &amp; 0xF) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="HW_HANDSHAKING" edc:desc="Hardware Handshaking" edc:when="(field &amp; 0xF) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MODEM" edc:desc="Modem" edc:when="(field &amp; 0xF) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="IS07816_T_0" edc:desc="IS07816 Protocol: T = 0" edc:when="(field &amp; 0xF) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="IS07816_T_1" edc:desc="IS07816 Protocol: T = 1" edc:when="(field &amp; 0xF) == 0x6"/>
              <edc:SFRFieldSemantic edc:cname="IRDA" edc:desc="IrDA" edc:when="(field &amp; 0xF) == 0x8"/>
              <edc:SFRFieldSemantic edc:cname="LON" edc:desc="LON" edc:when="(field &amp; 0xF) == 0x9"/>
              <edc:SFRFieldSemantic edc:cname="SPI_MASTER" edc:desc="SPI master" edc:when="(field &amp; 0xF) == 0xE"/>
              <edc:SFRFieldSemantic edc:cname="SPI_SLAVE" edc:desc="SPI Slave" edc:when="(field &amp; 0xF) == 0xF"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="USCLKS" edc:desc="Clock Selection" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="MCK" edc:desc="Peripheral clock is selected" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="DIV" edc:desc="Peripheral clock divided (DIV=DIV=8) is selected" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="PCK" edc:desc="PMC programmable clock (PCK) is selected. If the SCK pin is driven (CLKO = 1), the CD field must be greater than 1." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="SCK" edc:desc="Serial clock (SCK) is selected" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHRL" edc:desc="Character Length" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_5_BIT" edc:desc="Character length is 5 bits" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_6_BIT" edc:desc="Character length is 6 bits" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_7_BIT" edc:desc="Character length is 7 bits" edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="_8_BIT" edc:desc="Character length is 8 bits" edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="SYNC" edc:desc="Synchronous Mode Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PAR" edc:desc="Parity Type" edc:nzwidth="0x3">
              <edc:SFRFieldSemantic edc:cname="EVEN" edc:desc="Even parity" edc:when="(field &amp; 0x7) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="ODD" edc:desc="Odd parity" edc:when="(field &amp; 0x7) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="SPACE" edc:desc="Parity forced to 0 (Space)" edc:when="(field &amp; 0x7) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="MARK" edc:desc="Parity forced to 1 (Mark)" edc:when="(field &amp; 0x7) == 0x3"/>
              <edc:SFRFieldSemantic edc:cname="NO" edc:desc="No parity" edc:when="(field &amp; 0x7) == 0x4"/>
              <edc:SFRFieldSemantic edc:cname="MULTIDROP" edc:desc="Multidrop mode" edc:when="(field &amp; 0x7) == 0x6"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="NBSTOP" edc:desc="Number of Stop Bits" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="_1_BIT" edc:desc="1 stop bit" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="_1_5_BIT" edc:desc="1.5 stop bit (SYNC = 0) or reserved (SYNC = 1)" edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="_2_BIT" edc:desc="2 stop bits" edc:when="(field &amp; 0x3) == 0x2"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="CHMODE" edc:desc="Channel Mode" edc:nzwidth="0x2">
              <edc:SFRFieldSemantic edc:cname="NORMAL" edc:desc="Normal mode" edc:when="(field &amp; 0x3) == 0x0"/>
              <edc:SFRFieldSemantic edc:cname="AUTOMATIC" edc:desc="Automatic Echo. Receiver input is connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x1"/>
              <edc:SFRFieldSemantic edc:cname="LOCAL_LOOPBACK" edc:desc="Local Loopback. Transmitter output is connected to the Receiver Input." edc:when="(field &amp; 0x3) == 0x2"/>
              <edc:SFRFieldSemantic edc:cname="REMOTE_LOOPBACK" edc:desc="Remote Loopback. RXD pin is internally connected to the TXD pin." edc:when="(field &amp; 0x3) == 0x3"/>
            </edc:SFRFieldDef>
            <edc:SFRFieldDef edc:cname="MSBF" edc:desc="Bit Order" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODE9" edc:desc="9-bit Character Length" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CLKO" edc:desc="Clock Output Select" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="OVER" edc:desc="Oversampling Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INACK" edc:desc="Inhibit Non Acknowledge" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSNACK" edc:desc="Disable Successive NACK" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="VAR_SYNC" edc:desc="Variable Synchronization of Command/Data Sync Start Frame Delimiter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="INVDATA" edc:desc="Inverted Data" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAX_ITERATION" edc:desc="Maximum Number of Automatic Iteration" edc:nzwidth="0x3"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="FILTER" edc:desc="Receive Line Filter" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MAN" edc:desc="Manchester Encoder/Decoder Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="MODSYNC" edc:desc="Manchester Synchronization Mode" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ONEBIT" edc:desc="Start Frame Delimiter Selector" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x4002C008" edc:access="-------w----wwww--w--wwwwww--www" edc:cname="US_IER" edc:nzwidth="0x20" ltx:memberofperipheral="USART2">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="RXRDY" edc:desc="RXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXRDY" edc:desc="TXRDY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="RXBRK" edc:desc="Receiver Break Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="OVRE" edc:desc="Overrun Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="FRAME" edc:desc="Framing Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="PARE" edc:desc="Parity Error Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TIMEOUT" edc:desc="Time-out Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="TXEMPTY" edc:desc="TXEMPTY Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ITER" edc:desc="Max number of Repetitions Reached Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="NACK" edc:desc="Non Acknowledge Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x2"/>
            <edc:SFRFieldDef edc:cname="RIIC" edc:desc="Ring Indicator Input Change Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DSRIC" edc:desc="Data Set Ready Input Change Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="DCDIC" edc:desc="Data Carrier Detect Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="CTSIC" edc:desc="Clear to Send Input Change Interrupt Enable" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x4"/>
            <edc:SFRFieldDef edc:cname="MANE" edc:desc="Manchester Error Interrupt Enable" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
