Duet3D/Duet3Expansion/src/atmel/SAME70_DFP/2.3.98/same70a/edc/ATSAME70Q21.PIC
    <edc:Pin>
      <edc:VirtualPin edc:name="PD15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RXD2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NWR1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="NBS1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TXD1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D10" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK9" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SCK0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DAC0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMIC"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="HSDM"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXEN" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DTR0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC24" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A6" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SPCK" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTX1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD4" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="RI0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD7" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXER" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="RI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA6" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="UTXD1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NBS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NBS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NBS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="JTAGSEL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A22" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDCLE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A22" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDCLE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A22" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDCLE" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA9" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD11" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDOUT"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VBG"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC25" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A7" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS0" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC23" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A5" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC22" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A4" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCDA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA28" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="DSR1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MCCDA" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWCK1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A17" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCRS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TD" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREFP"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="ADVREFN"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="UTXD3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GTXCK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="DCD0" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="DAC1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDANA"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD4" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXDV" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DCD2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD5" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="DTR2" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH2" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDIO" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMFI2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="ADTRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="SDWE" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDWE" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDWE" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC16" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A21" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDALE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A21" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDALE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A21" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDALE" edc:ppsfunction="A"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A18" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC31" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A13" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC27" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A9" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PE3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA10" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="D0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDUTMI"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDUTMII"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD8" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GMDC" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMFI1" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D5" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA2" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="DATRG" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC30" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A12" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD5" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC26" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A8" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA4" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="MISO" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC29" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="A11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="A11" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA5" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD4" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB8" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="CANRX1" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD3" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GNDPLL"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDPLLUSB"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB7" edc:ppsfunction="default"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC10" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NANDWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDWE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TCLK7" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC11" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NRD" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NRD" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NRD" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOA8" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA3" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="TWD0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="LONCOL1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC15" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NCS1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCS" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWML3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="AD2" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NWAIT" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB1" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TK" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD0" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT1" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="GND"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD13" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GCOL" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDA10" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRX3" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="CANTX1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="NPCS2" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D6" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PC9" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="NANDOE" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="TIOB7" edc:ppsfunction="B"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB12" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="GTSUCOMP" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PCK0" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA19" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML0" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A15" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD8" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP9" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA18" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMEXTRG1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK2" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A14" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD7" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA20" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWML1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="A16" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="BA0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD9" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="WKUP10" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PB0" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH0" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="RXD0" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="TF" edc:ppsfunction="D"/>
      <edc:VirtualPin edc:name="AD10" edc:ppsfunction="X1"/>
      <edc:VirtualPin edc:name="RTCOUT0" edc:ppsfunction="X1"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDIO"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="VDDCORE"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD21" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="PWMH1" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="MOSI" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="TIOA11" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="D1" edc:ppsfunction="D"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PD14" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="GRXCK" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="SDCKE" edc:ppsfunction="C"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="TST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="NRST"/>
    </edc:Pin>
    <edc:Pin>
      <edc:VirtualPin edc:name="PA17" edc:ppsfunction="default"/>
      <edc:VirtualPin edc:name="QIO2" edc:ppsfunction="A"/>
      <edc:VirtualPin edc:name="PCK1" edc:ppsfunction="B"/>
      <edc:VirtualPin edc:name="PWMH3" edc:ppsfunction="C"/>
      <edc:VirtualPin edc:name="AD6" edc:ppsfunction="X1"/>
    </edc:Pin>
